## Задача №2:
#
# Ганс Грубер в это время пытается намайнить биткоины - чтобы сделать это ему нужно найти MD5 хэши,
# которые начинаются как минимум с 5 нулей.
# Значение, хэш которого нужно посчитать - это инпут (пользовательский ввод), за которым следует положительное число (1, 2, 3 итд).
#
# Например, для инпута abcdef результатом будет число 609043, потому что MD5 хэш для abcdef609043 начинается с 5 нулей (000001dbbfa...)
# и это минимальное такое число.
#
# Помогите Гансу найти это число.
#
# Требования к решению:
# - Инпут вводится пользователем (получение данных в коде через команду gets)
# - Результат (число) выводится через puts
#
#
## Решение:

require "digest"

last = gets.chomp
b = Digest::MD5.hexdigest(last)
c = 0
g = 0
checker = 0
while c != 1
  g += 1
  new =last+g.to_s
  b = Digest::MD5.hexdigest(new)
  d = b.split(//)
  for i in 0..4
    if d[i] == '0'
      checker += 1
    end
  end
  if checker == 5
    c = 1
  else
    checker = 0
  end
end
puts (g)
