## Задача №4:
#
# Джон добрался до этажа с бомбой, но у него на пути стоит дверь с кодовым замком и рядом бумажка с инструкциями (файл data/3.txt)
#
# Чтобы узнать код от замка, ему нужно для каждой строки найти разницу между наибольшим и наименьшим числами и потом сложить полученные значения
#
## Требования к решению:
# - Входные данные находятся в файле data/3.txt (разделитель значений - символ табуляции)
# - Результат должен быть выведен в консоль командой puts
#
## Решение:


lines = IO.readlines("data/3.txt")
result=0
for i in (0..(lines.length-1))
  elements = lines[i].split(/\t/).map(&:to_i)
  max_elem = elements.max
  min_elem = elements.min
  result = result + (max_elem-min_elem)
end
puts result



